# GetPlane Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePlane..::..GetPlane Method
ReferencePlane Class See Also
---
Returns the geometry plane to which the reference plane is assigned.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Plane GetPlane()
```

Visual Basic
---
```text
Public Function GetPlane As Plane
```

Visual C++
---
```text
public:
Plane^ GetPlane()
```

# ### Return Value
The geometry plane to which the reference plane is assigned.
# See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace